int/resources/objectRepo/xmlTemplates/ows/OWSProfileService/req_InsertPreference.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="http://webservices.micros.com/og/4.3/Common/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:name="http://webservices.micros.com/ows/5.1/Name.wsdl" xmlns:name1="http://webservices.micros.com/og/4.3/Name/">
   <soapenv:Header>
      <core:OGHeader authToken="?" channelValidation="true" primaryLangID="E" terminalID="?" timeStamp="?" transactionID="?">
         <core:Origin entityID="?" organizationID="?" systemType="?"/>
         <core:Destination entityID="?" organizationID="?" systemType="?"/>
         <core:Intermediaries>
            <core:EndPoint entityID="?" organizationID="?" systemType="?"/>
         </core:Intermediaries>
         <core:Authentication>
            <core:UserCredentials>
               <core:UserName/>
               <core:UserPassword/>
               <core:Domain/>
               <core:SecurityId/>
            </core:UserCredentials>
            <core:Licence>
               <core:Key/>
            </core:Licence>
         </core:Authentication>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <name:InsertPreferenceRequest>
         <name:NameID source="?" type="?"/>
         <name:Preference inactiveDate="?" insertDate="?" insertUser="?" otherPreferenceType="?" preferenceType="?" preferenceValue="?" resortCode="?" updateDate="?" updateUser="?">
            <name1:PreferenceDescription>
               <com:Text>
                  <com:TextElement formatted="?" language="?"/>
               </com:Text>
               <com:Image/>
               <com:Url/>
            </name1:PreferenceDescription>
         </name:Preference>
      </name:InsertPreferenceRequest>
   </soapenv:Body>
</soapenv:Envelope>